import React from 'react'

export default function CssInJSStyle() {
  return (
    <div>1. CssInJSStyle</div>
  )
}

/*
  1. CSS-in-JS로 스타일링 하기
  - 기존의 웹 개발 방식은 'HTML, CSS, 자바스크립트'를 각각 분리해서 개발하는 구조
  - 이 방식은 '관심사 분리'라는 소프트웨어 설계 원칙에 기반을 두고 있다
  - 이방식의 목적은 각 기술의 명확하게 구분함으로써 유지보수성과 확장성을 높이려는 것
  - 그러나 웹 애플리케이션이 점점 더 복잡해지고 '리액트'나 '뷰'와 같은 프런트엔드 프레임워크의 도입으로 컴포넌트 기반 개발 방식이 보편화돠면서 기존의 방식은 다음과 같은 문제점이 있다
    <문제점>
    (1) 전역 스코프 문제
    = 기존 CSS는 전역 스코프로 작동하기 때문에 클래스 이름 충돌이 자주 발생하고 이를 방치하기 위한 명명 규칙 관리도 복잡하다

    (2) 상태 기반 스타일링의 어려움
    = UI의 상태는 자바스크립트로 제어하는 반면 스타일은 CSS 파일에 따로 정의하므로 동적 상태 변화에 따른 스타일 조작이 번거롭고 복잡하다 

    (3) 유지보수의 어려움
    = 프로젝트 규모가 커질수록 어떤 스타일이 어떤 컴포넌트에 적용되는지 파악하기 힘들고 사용하지 않는 CSS를 완전히 제거하는 것도 쉽지 않다

  - 이러한 문제를 해결하고자 등장한 스타일링 방식이 'CSS-in-JS'이다
  - 'CSS-in-JS'는 자바스크립트 파일 안에 스타일을 정의하고 적용하는 방식으로 동적 스타일링을 매우 쉽게 처리
  - 이 방식은 컴포넌트 단위로 스타일을 작성하므로 클래스 충돌이 없고 재사용성도 높인다
  - 그리고 상태, props, 조건 등을 바탕으로 동적으로 스타일을 조절할 수 있는 유연성이 있다 
  - 리액트 생태계에서 널리 사용하는 대표적인 라이브러리는 'style-components, emotion, vanilla-extract'이다
*/
